print("Побєдімська Соня Ігорівна\nЛабораторна робота №2\nВаріант 17\nЗнаходження максимального цілого числа, "
      "квадрат якого мешний за N\n")

i = 0
max_int = 0
n = 0

exit = ""
while exit == "":
 while n <= 0 or ValueError:
     try:
      n = float(input("Будь ласка, введіть додатнє N: "))
      break
     except ValueError:
         print("Для такого значення неможливо вирішити задачу, спробуйте щось інше.")
         n = 0

 while i <= n:
     if i**2 <= n:
         max_int = i
         i += 1
     else:
         break

 print("\nНайбільше число, квадрат якого менше або дорівнює "+str(n)+" це", str(max_int))
 exit = input("Введіть будь-що для виходу або нажміть ENTER для продовження")